In [2]:
import pandas as pd
import numpy as np
from pydataset import data
import matplotlib.pyplot as plt

# Exercises 1

## 1. Create a function named get_db_url. It should accept a username, hostname, password, and database name and return a url connection string formatted like in the example at the start of this lesson.

In [3]:
from env import host, user, password

In [4]:
def get_db_url(user, host, password, dbname):
    url = f'mysql+pymysql://{user}:{password}@{host}/{dbname}'
    return url

## 2.Use your function to obtain a connection to the employees database.

In [5]:
url = get_db_url(user, host, password, 'employees')

In [6]:
## 3. Once you have successfully run a query:

pd.read_sql('SELECT * FROM salaries limit 100', url)

    emp_no  salary   from_date     to_date
0    10001   60117  1986-06-26  1987-06-26
1    10001   62102  1987-06-26  1988-06-25
2    10001   66074  1988-06-25  1989-06-25
3    10001   66596  1989-06-25  1990-06-25
4    10001   66961  1990-06-25  1991-06-25
5    10001   71046  1991-06-25  1992-06-24
6    10001   74333  1992-06-24  1993-06-24
7    10001   75286  1993-06-24  1994-06-24
8    10001   75994  1994-06-24  1995-06-24
9    10001   76884  1995-06-24  1996-06-23
10   10001   80013  1996-06-23  1997-06-23
11   10001   81025  1997-06-23  1998-06-23
12   10001   81097  1998-06-23  1999-06-23
13   10001   84917  1999-06-23  2000-06-22
14   10001   85112  2000-06-22  2001-06-22
15   10001   85097  2001-06-22  2002-06-22
16   10001   88958  2002-06-22  9999-01-01
17   10002   65828  1996-08-03  1997-08-03
18   10002   65909  1997-08-03  1998-08-03
19   10002   67534  1998-08-03  1999-08-03
20   10002   69366  1999-08-03  2000-08-02
21   10002   71963  2000-08-02  2001-08-02
22   10002   72527  2001-08-02  9999-01-01
23   10003   40006  1995-12-03  1996-12-02
24   10003   43616  1996-12-02  1997-12-02
25   10003   43466  1997-12-02  1998-12-02
26   10003   43636  1998-12-02  1999-12-02
27   10003   43478  1999-12-02  2000-12-01
28   10003   43699  2000-12-01  2001-12-01
29   10003   43311  2001-12-01  9999-01-01
30   10004   40054  1986-12-01  1987-12-01
31   10004   42283  1987-12-01  1988-11-30
32   10004   42542  1988-11-30  1989-11-30
33   10004   46065  1989-11-30  1990-11-30
34   10004   48271  1990-11-30  1991-11-30
35   10004   50594  1991-11-30  1992-11-29
36   10004   52119  1992-11-29  1993-11-29
37   10004   54693  1993-11-29  1994-11-29
38   10004   58326  1994-11-29  1995-11-29
39   10004   60770  1995-11-29  1996-11-28
40   10004   62566  1996-11-28  1997-11-28
41   10004   64340  1997-11-28  1998-11-28
42   10004   67096  1998-11-28  1999-11-28
43   10004   69722  1999-11-28  2000-11-27
44   10004   70698  2000-11-27  2001-11-27
45   10004   74057  2001-11-27  9999-01-01
46   10005   78228  1989-09-12  1990-09-12
47   10005   82621  1990-09-12  1991-09-12
48   10005   83735  1991-09-12  1992-09-11
49   10005   85572  1992-09-11  1993-09-11
50   10005   85076  1993-09-11  1994-09-11
51   10005   86050  1994-09-11  1995-09-11
52   10005   88448  1995-09-11  1996-09-10
53   10005   88063  1996-09-10  1997-09-10
54   10005   89724  1997-09-10  1998-09-10
55   10005   90392  1998-09-10  1999-09-10
56   10005   90531  1999-09-10  2000-09-09
57   10005   91453  2000-09-09  2001-09-09
58   10005   94692  2001-09-09  9999-01-01
59   10006   40000  1990-08-05  1991-08-05
60   10006   42085  1991-08-05  1992-08-04
61   10006   42629  1992-08-04  1993-08-04
62   10006   45844  1993-08-04  1994-08-04
63   10006   47518  1994-08-04  1995-08-04
64   10006   47917  1995-08-04  1996-08-03
65   10006   52255  1996-08-03  1997-08-03
66   10006   53747  1997-08-03  1998-08-03
67   10006   56032  1998-08-03  1999-08-03
68   10006   58299  1999-08-03  2000-08-02
69   10006   60098  2000-08-02  2001-08-02
70   10006   59755  2001-08-02  9999-01-01
71   10007   56724  1989-02-10  1990-02-10
72   10007   60740  1990-02-10  1991-02-10
73   10007   62745  1991-02-10  1992-02-10
74   10007   63475  1992-02-10  1993-02-09
75   10007   63208  1993-02-09  1994-02-09
76   10007   64563  1994-02-09  1995-02-09
77   10007   68833  1995-02-09  1996-02-09
78   10007   70220  1996-02-09  1997-02-08
79   10007   73362  1997-02-08  1998-02-08
80   10007   75582  1998-02-08  1999-02-08
81   10007   79513  1999-02-08  2000-02-08
82   10007   80083  2000-02-08  2001-02-07
83   10007   84456  2001-02-07  2002-02-07
84   10007   88070  2002-02-07  9999-01-01
85   10008   46671  1998-03-11  1999-03-11
86   10008   48584  1999-03-11  2000-03-10
87   10008   52668  2000-03-10  2000-07-31
88   10009   60929  1985-02-18  1986-02-18
89   10009   64604  1986-02-18  1987-02-18
90   10009   64780  1987-02-18  1988-02-18
91   10009   66302  1988-02-18  1989-02-17
92   10009   69042  1989-02-17  1990-02-17
93   10009   70889  1990-02-17  1991-02-17
94   10009   71434  1991-02-17  1992-02-17
95   10009   74612  1992-02-17  1993-02-16
96   10009   76518  1993-02-16  1994-02-16
97   10009   78335  1994-02-16  1995-02-16
98   10009   80944  1995-02-16  1996-02-16
99   10009   82507  1996-02-16  1997-02-15

### a. Intentionally make a typo in the database url. What kind of error message do you see?

In [7]:
url2=get_db_url(user, host, password, 'empoyees')

In [8]:
# pd.read_sql('SELECT * FROM salaries LIMIT 5 OFFSET 50', url2)
# returns OperationalError: (pymysql.err.OperationalError) (1044, "Access denied for user 'xyz'@'%' to database 'empoyees'")

### b. Intentionally make an error in your SQL query. What does the error message look like?

In [9]:
# pd.read_sql('SELECT * FOM salaries LIMIT 5 OFFSET 50', url)
# returns ProgrammingError: (pymysql.err.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax
# to use near 'FOM salaries LIMIT 5 OFFSET 50' at line 1")

## 4. Read the employees and titles tables into two separate DataFrames.

In [11]:
emp_df = pd.read_sql('SELECT * FROM employees', url)
type(emp_df)

pandas.core.frame.DataFrame

In [12]:
emp_df

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [13]:
titles_df = pd.read_sql('SELECT * FROM titles', url)
titles_df

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

## 5. How many rows and columns do you have in each DataFrame? Is that what you expected?

In [14]:
titles_df.shape

(443308, 4)

In [15]:
emp_df.shape

(300024, 6)

## 6. Display the summary statistics for each DataFrame.

In [16]:
titles_df.describe(include = 'all')

               emp_no     title   from_date     to_date
count   443308.000000    443308      443308      443308
unique            NaN         7        6393        5888
top               NaN  Engineer  1998-10-25  9999-01-01
freq              NaN    115003         132      240124
mean    253075.034430       NaN         NaN         NaN
std     161853.292613       NaN         NaN         NaN
min      10001.000000       NaN         NaN         NaN
25%      84855.750000       NaN         NaN         NaN
50%     249847.500000       NaN         NaN         NaN
75%     424891.250000       NaN         NaN         NaN
max     499999.000000       NaN         NaN         NaN

In [17]:
emp_df.describe(exclude = np.number)
# to get a quick look at object columns

        birth_date first_name last_name  gender   hire_date
count       300024     300024    300024  300024      300024
unique        4750       1275      1637       2        5434
top     1952-03-08     Shahab      Baba       M  1985-06-20
freq            95        295       226  179973         132

## 7. How many unique titles are in the titles DataFrame?

In [18]:
titles_df.title.unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

## 8. What is the oldest date in the to_date column?

In [19]:
titles_df.sort_values(by = ['to_date']).head(1)

# or 

titles_df.to_date.min()

datetime.date(1985, 3, 1)

## 9. What is the most recent date in the to_date column?

In [20]:
titles_df.to_date.max()

datetime.date(9999, 1, 1)

# Exercises 2

## 1. Copy the users and roles DataFrames from the examples above.

In [80]:
# Create the users DataFrame.

users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [83]:
# Create the roles DataFrame

roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

## 2. What is the result of using a right join on the DataFrames?

In [85]:
users.merge(roles, left_on='role_id', right_on='id', how='right', indicator=True)
# duplicate column names

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0     1      admin        both
1   2.0    joe      2.0     2     author        both
2   3.0  sally      3.0     3   reviewer        both
3   4.0   adam      3.0     3   reviewer        both
4   NaN    NaN      NaN     4  commenter  right_only

## 3. What is the result of using an outer join on the DataFrames?

In [87]:
users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)
# all the rows and columns from both tables

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

## 4. What happens if you drop the foreign keys from the DataFrames and try to merge them?

In [89]:
users2 = users.copy()
users2

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [98]:
# drop the role_id column
new_users = users2.drop(columns='role_id')
new_users

   id   name
0   1    bob
1   2    joe
2   3  sally
3   4   adam
4   5   jane
5   6   mike

In [100]:
# try to merge the df with foreign key dropped with roles but get a key error
new_users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)

KeyError: 'role_id'

## 5. Load the mpg dataset from PyDataset.

In [26]:
mpg = data('mpg')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

## 6. Output and read the documentation for the mpg dataset

In [25]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

## 7. How many rows and columns are in the dataset?

In [27]:
mpg.shape

(234, 11)

## 8. Check out your column names and perform any cleanup you may want on them.

In [28]:
mpg.columns

Index(['manufacturer', 'model', 'displ', 'year', 'cyl', 'trans', 'drv', 'cty',
       'hwy', 'fl', 'class'],
      dtype='object')

In [30]:
# rename columns
mpg2 = mpg.copy()
mpg2

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

In [38]:
mpg2.rename(columns={'displ': 'engine displacement', 'cyl': 'cylinder',
                     'trans': 'transmission',
                     'drv': 'drive',
                     'cty': 'city',
                     'hwy': 'highway'},inplace = True)
mpg2

,manufacturer,model,engine displacement,year,cylinder,transmission,drive,city,highway,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

## 9. Display the summary statistics for the dataset.

In [39]:
mpg2.describe()

       engine displacement         year    cylinder        city     highway
count           234.000000   234.000000  234.000000  234.000000  234.000000
mean              3.471795  2003.500000    5.888889   16.858974   23.440171
std               1.291959     4.509646    1.611534    4.255946    5.954643
min               1.600000  1999.000000    4.000000    9.000000   12.000000
25%               2.400000  1999.000000    4.000000   14.000000   18.000000
50%               3.300000  2003.500000    6.000000   17.000000   24.000000
75%               4.600000  2008.000000    8.000000   19.000000   27.000000
max               7.000000  2008.000000    8.000000   35.000000   44.000000

## 10. How many different manufacturers are there?

In [40]:
len(mpg2.manufacturer.value_counts())

15

## 11. How many different models are there?

In [41]:
len(mpg2.model.value_counts())

38

## 12. Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain the difference between highway and city mileage for each car.

In [49]:
mpg2['mileage_difference'] = mpg2.highway - mpg2.city
mpg2

,manufacturer,model,engine displacement,year,cylinder,transmission,drive,city,highway,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

## 13. Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city and highway mileage.

In [60]:
mpg2['average_mileage'] = (mpg2.highway + mpg2.city) / 2
mpg2

,manufacturer,model,engine displacement,year,cylinder,transmission,drive,city,highway,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

## 14. Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car has an automatic transmission.

In [64]:
mpg2['is_automatic'] = np.where(mpg2.transmission.str.contains('auto') == True, True, False)
mpg2

,manufacturer,model,engine displacement,year,cylinder,transmission,drive,city,highway,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

## 15. Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

In [80]:
mpg2.groupby('manufacturer').average_mileage.max().sort_values(ascending = False).nlargest(1, keep = 'all')

manufacturer
volkswagen    39.5
Name: average_mileage, dtype: float64

## 16. Do automatic or manual cars have better miles per gallon?

In [96]:
mpg2.groupby('transmission').average_mileage.mean().round(2)

transmission
auto(av)      23.90
auto(l3)      24.00
auto(l4)      18.95
auto(l5)      17.72
auto(l6)      16.83
auto(s4)      22.17
auto(s5)      21.33
auto(s6)      21.28
manual(m5)    22.78
manual(m6)    20.55
Name: average_mileage, dtype: float64

In [99]:
mpg2['type_transmission'] = mpg2.transmission.apply(lambda n: 'manual' if n == 'manual(m5)' or n == 'manual(m6)' else 'automatic')

mpg2

,manufacturer,model,engine displacement,year,cylinder,transmission,drive,city,highway,fl,class,mileage_difference,average_mileage,is_automatic,type_transmission
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True,automatic
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False,manual
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False,manual
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True,automatic
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True,automatic
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True,automatic
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False,manual
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True,automatic
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False,manual
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True,automatic

In [102]:
mpg2.groupby('type_transmission').average_mileage.mean()
# manual cars have better mileage than automatic cars

type_transmission
automatic    19.130573
manual       22.227273
Name: average_mileage, dtype: float64

# Exercises III

## 1. Use your get_db_url function to help you explore the data from the chipotle database

In [21]:
# reads from the chipotle db

chipotle_query = """
select *
from chipotle.orders
"""

orders_table = pd.read_sql(chipotle_query,get_db_url(user, host, password,'chipotle'))

orders_table

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,$2.39
1,2,1,1,Izze,[Clementine],$3.39
2,3,1,1,Nantucket Nectar,[Apple],$3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,$2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",$16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",$11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",$11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",$8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",$8.75

## 2. What is the total price for each order?

In [184]:
orders_table.dtypes

id                     int64
order_id               int64
quantity               int64
item_name             object
choice_description    object
item_price            object
dtype: object

In [185]:
orders_table.item_price = orders_table.item_price.str.replace('$','').astype('float')

In [186]:
orders_table

,id,order_id,quantity,item_name,choice_description,item_price
0,1,1,1,Chips and Fresh Tomato Salsa,nan,2.39
1,2,1,1,Izze,[Clementine],3.39
2,3,1,1,Nantucket Nectar,[Apple],3.39
3,4,1,1,Chips and Tomatillo-Green Chili Salsa,nan,2.39
4,5,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans, Rice, Cheese, Sour Cream]]",16.98
...,...,...,...,...,...,...
4617,4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour Cream, Cheese, Lettuce, Guacamole]]",11.75
4618,4619,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese, Lettuce, Guacamole]]",11.75
4619,4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Guacamole, Lettuce]]",11.25
4620,4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettuce]]",8.75
4621,4622,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto Beans, Lettuce]]",8.75

In [188]:
orders_table.groupby('order_id').item_price.sum()

order_id
1       11.56
2       16.98
3       12.67
4       21.00
5       13.70
        ...
1830    23.00
1831    12.90
1832    13.20
1833    23.50
1834    28.75
Name: item_price, Length: 1834, dtype: float64

## 3. What are the most popular 3 items?

In [162]:
orders_table.item_name.value_counts().nlargest(3, keep = 'all')

Chicken Bowl           726
Chicken Burrito        553
Chips and Guacamole    479
Name: item_name, dtype: int64

In [168]:
# or

orders_db.groupby('item_name').quantity.sum().sort_values(ascending=False)[:3]

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Name: quantity, dtype: int64

## 4. Which item has produced the most revenue?

In [191]:
item_revenue = orders_table.groupby('item_name').item_price.sum().sort_values(ascending=False)[:1]
item_revenue

item_name
Chicken Bowl    7342.73
Name: item_price, dtype: float64